## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.functions.google_storage_bucket_object.notification_source has been deleted
  - resource "google_storage_bucket_object" "notification_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/notification-1802832a0cd493dc930348b20e229c13.zip"
      - name             = "functions/notification-1802832a0cd493dc930348b20e229c13.zip" -> null
        # (14 unchanged attributes hidden)
    }

  # module.functions.google_storage_bucket_object.scoring_source has been deleted
  - resource "google_storage_bucket_object" "scoring_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-124d092887a4744226d3301309de6734.zip"
      - name             = "functions/scoring-124d092887a4744226d3301309de6734.zip" -> null
        # (14 unchanged attributes hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source has been deleted
  - resource "google_storage_bucket_object" "webhook_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-32b1e683b49f8eb116836441f3217dda.zip"
      - name             = "functions/webhook-32b1e683b49f8eb116836441f3217dda.zip" -> null
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.functions.data.archive_file.application_notify_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "application_notify_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/application-notify"
      + type                = "zip"
    }

  # module.functions.data.archive_file.notification_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "notification_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/notification"
      + type                = "zip"
    }

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloud_run_service_iam_member.application_notify_run_invoker will be created
  + resource "google_cloud_run_service_iam_member" "application_notify_run_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + project  = "wedding-smile-catcher"
      + role     = "roles/run.invoker"
      + service  = "application-notify"
    }

  # module.functions.google_cloudfunctions2_function.application_notify will be created
  + resource "google_cloudfunctions2_function" "application_notify" {
      + description      = "Application form notification sender"
      + effective_labels = {
          + "environment"                = "production"
          + "function"                   = "application-notify"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + environment      = (known after apply)
      + id               = (known after apply)
      + labels           = {
          + "environment" = "production"
          + "function"    = "application-notify"
          + "managed_by"  = "terraform"
        }
      + location         = "asia-northeast1"
      + name             = "application-notify"
      + project          = "wedding-smile-catcher"
      + state            = (known after apply)
      + terraform_labels = {
          + "environment"                = "production"
          + "function"                   = "application-notify"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
        }
      + update_time      = (known after apply)
      + url              = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "application_notify"
          + environment_variables = (known after apply)
          + runtime               = "python311"
          + service_account       = (known after apply)

          + source {
              + storage_source {
                  + bucket     = "wedding-smile-images-wedding-smile-catcher"
                  + generation = (known after apply)
                  + object     = (known after apply)
                }
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "256M"
          + direct_vpc_egress                = (known after apply)
          + environment_variables            = {
              + "ADMIN_EMAIL"        = "nicosnap.contact@gmail.com"
              + "ADMIN_LINE_USER_ID" = "U38da835664266be55e793bdcbe2e758f"
              + "GCP_PROJECT_ID"     = "wedding-smile-catcher"
              + "SMTP_EMAIL"         = "nicosnap.contact@gmail.com"
            }
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = 10
          + max_instance_request_concurrency = (known after apply)
          + min_instance_count               = 0
          + service                          = (known after apply)
          + service_account_email            = "webhook-function-sa@wedding-smile-catcher.iam.gserviceaccount.com"
          + timeout_seconds                  = 60
          + uri                              = (known after apply)

          + secret_environment_variables {
              + key        = "LINE_CHANNEL_ACCESS_TOKEN"
              + project_id = "wedding-smile-catcher"
              + secret     = "line-channel-access-token"
              + version    = "latest"
            }
          + secret_environment_variables {
              + key        = "SMTP_PASSWORD"
              + project_id = "wedding-smile-catcher"
              + secret     = "smtp-password"
              + version    = "latest"
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.liff_join will be updated in-place
  ~ resource "google_cloudfunctions2_function" "liff_join" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/liff-join"
        name             = "liff-join"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-32b1e683b49f8eb116836441f3217dda.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
            # (12 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ key        = "LIFF_CHANNEL_ID" -> "LINE_CHANNEL_SECRET"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "liff-channel-id" -> "line-channel-secret"
                # (1 unchanged attribute hidden)
            }
          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_SECRET" -> "LIFF_CHANNEL_ID"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-secret" -> "liff-channel-id"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.notification will be updated in-place
  ~ resource "google_cloudfunctions2_function" "notification" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/notification"
        name             = "notification"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/notification-1802832a0cd493dc930348b20e229c13.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ available_memory                 = "512M" -> "256M"
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-124d092887a4744226d3301309de6734.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID" = "test" -> null
                # (3 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-32b1e683b49f8eb116836441f3217dda.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID"     = "test" -> null
                # (4 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_ACCESS_TOKEN" -> "LINE_CHANNEL_SECRET"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-access-token" -> "line-channel-secret"
                # (1 unchanged attribute hidden)
            }
          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_SECRET" -> "LINE_CHANNEL_ACCESS_TOKEN"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-secret" -> "line-channel-access-token"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function_iam_member.application_notify_invoker will be created
  + resource "google_cloudfunctions2_function_iam_member" "application_notify_invoker" {
      + cloud_function = "application-notify"
      + etag           = (known after apply)
      + id             = (known after apply)
      + location       = "asia-northeast1"
      + member         = "allUsers"
      + project        = "wedding-smile-catcher"
      + role           = "roles/cloudfunctions.invoker"
    }

  # module.functions.google_storage_bucket_object.application_notify_source will be created
  + resource "google_storage_bucket_object" "application_notify_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.functions.google_storage_bucket_object.notification_source will be created
  + resource "google_storage_bucket_object" "notification_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.functions.google_storage_bucket_object.scoring_source will be created
  + resource "google_storage_bucket_object" "scoring_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.functions.google_storage_bucket_object.webhook_source will be created
  + resource "google_storage_bucket_object" "webhook_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

Plan: 7 to add, 4 to change, 0 to destroy.

Changes to Outputs:
  + application_notify_function_url = (known after apply)
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
